; domain
;; This is a domain for the Emergency Services Logistics problem in TDDC17

;; In this domain we have 3 type of crates(med,food,water)
;; One or more uavs fly between locations and load/unload crates.
;; Crates are unloaded to people.

(define (domain logistics)
  (:requirements :strips)
  (:predicates

   ;; Static predicates:
   (med_crate ?m) (food_crate ?f) (uav ?u) (water_crate ?w)
   (person ?p) (crate ?c) (location ?l)

   ;; Non-static predicates:
   (at ?x ?l) ;; ?x (crates, uav, people) is at location ?l
   (in ?k ?u) ;; ?k (crates in people)
   (loaded ?c ?u) ;; crates loaded on uavs.
   (unloaded ?u) ;; unloaded if uavs are empty.
   )

  ;; Actions for loading and unloading crates.
  ;; By declaring all crates to be a crate we can use load/unload for them all
  ;; we check if uav is at the same location as crate and if uav is unloaded.
  (:action load
    :parameters (?c ?u ?l) ;; all types of crates can be loaded to the uav
    :precondition (and (crate ?c) (uav ?u) (location ?l)
		       (at ?u ?l) (at ?c ?l)(unloaded ?u))
    :effect (and (loaded ?c ?u) (not (at ?c ?l)) (not (unloaded ?u))))

  ;; We check if uav is at a location with a person and unload the crate at it. If the crate is the one that the person
  ;; needs is something that is handled in the problem file definition.
  (:action unload
    :parameters (?c ?u ?l ?p)
    :precondition (and (crate ?c) (uav ?u) (location ?l) (person ?p)
		       (at ?u ?l) (loaded ?c ?u) (at ?p ?l))
    :effect (and (in ?c ?p) (not(loaded ?c ?u)) (unloaded ?u)))

  ;;Flies between locations. Since they are drones adjacency is not accounted for
  (:action fly
      :parameters (?u ?l1 ?l2)
      :precondition (and (uav ?u) (location ?l1) (location ?l2)
  		       (at ?u ?l1))
      :effect (and (at ?u ?l2) (not (at ?u ?l1))))
    )

; problem
;; This is a problem for the Emergency Services Logistics problem in TDDC17
;; as defined in "domainFile.pddl".

(define (problem C3_2)
  (:domain logistics)
  (:objects
   uav1 uav2                                              ;; there are two uavs
   med_crate1 med_crate2 med_crate3                       ;; There are 3 medical crates
   water_crate1 water_crate2 water_crate3                 ;; There are 3 water crates
   food_crate1 food_crate2 food_crate3                    ;; There are 3 food crates
   person1 person2 person3                                ;; There are 3 persons
   location1 location2 location3                          :: There are 3 locations

   )
  (:init
   ;; Type declarations:
   ;; all med/water/food crates are crates and that specific crate.
   (crate med_crate1) (crate med_crate2) (crate med_crate3)
   (crate water_crate1) (crate water_crate2) (crate water_crate3)
   (crate food_crate1) (crate food_crate2) (crate food_crate3)
   (med_crate med_crate1) (med_crate med_crate2) (med_crate med_crate3)
   (water_crate water_crate1) (water_crate water_crate2) (water_crate water_crate3)
   (food_crate food_crate1) (food_crate food_crate2) (food_crate food_crate3)

   ;;a person is a person
   (person person1) (person person2) (person person3)
   ;an uav is an uav.
   (uav uav1) (uav uav2)
   ;; locations are locations.
   (location location1) (location location2) (location location3)

   ;;uavs start unloaded in this instance
   (unloaded uav1) (unloaded uav2)

   ;; initial locations of all crates, uavs and people
   (at med_crate1 location1)  (at med_crate3 location1)
   (at water_crate1 location1)  (at water_crate3 location1)
   (at food_crate1 location1) (at food_crate2 location1)
   (at uav1 location1) (at uav2 location2)
   (at person1 location3) (at person2 location3) (at person3 location2)
   (in med_crate2 person2) (in water_crate2 person2) (in food_crate3 person3)
   )

  ;; The goal is to have all people have their corresponding crates:
  (:goal (and (in med_crate1 person1) (in food_crate1 person1) (in water_crate1 person1)
              (in med_crate2 person2) (in food_crate2 person2) (in water_crate2 person2)
              (in med_crate3 person3) (in food_crate3 person3) (in water_crate3 person3)))
  )

; plan
1. (load food_crate1 uav1 location1)
   deleted: (at food_crate1 location1) (unloaded uav1)
   added: (loaded food_crate1 uav1)
   goals met: 3 of 9
2. (fly uav1 location1 location3)
   deleted: (at uav1 location1)
   added: (at uav1 location3)
   goals met: 3 of 9
3. (unload food_crate1 uav1 location3 person1)
   deleted: (loaded food_crate1 uav1)
   added: (in food_crate1 person1) (unloaded uav1)
   goals met: 4 of 9
4. (fly uav2 location2 location1)
   deleted: (at uav2 location2)
   added: (at uav2 location1)
   goals met: 4 of 9
5. (load food_crate2 uav2 location1)
   deleted: (at food_crate2 location1) (unloaded uav2)
   added: (loaded food_crate2 uav2)
   goals met: 4 of 9
6. (fly uav2 location1 location3)
   deleted: (at uav2 location1)
   added: (at uav2 location3)
   goals met: 4 of 9
7. (unload food_crate2 uav2 location3 person2)
   deleted: (loaded food_crate2 uav2)
   added: (in food_crate2 person2) (unloaded uav2)
   goals met: 5 of 9
8. (fly uav2 location3 location1)
   deleted: (at uav2 location3)
   added: (at uav2 location1)
   goals met: 5 of 9
9. (load med_crate1 uav2 location1)
   deleted: (at med_crate1 location1) (unloaded uav2)
   added: (loaded med_crate1 uav2)
   goals met: 5 of 9
10. (fly uav2 location1 location3)
   deleted: (at uav2 location1)
   added: (at uav2 location3)
   goals met: 5 of 9
11. (unload med_crate1 uav2 location3 person1)
   deleted: (loaded med_crate1 uav2)
   added: (in med_crate1 person1) (unloaded uav2)
   goals met: 6 of 9
12. (fly uav2 location3 location1)
   deleted: (at uav2 location3)
   added: (at uav2 location1)
   goals met: 6 of 9
13. (load med_crate3 uav2 location1)
   deleted: (at med_crate3 location1) (unloaded uav2)
   added: (loaded med_crate3 uav2)
   goals met: 6 of 9
14. (fly uav2 location1 location2)
   deleted: (at uav2 location1)
   added: (at uav2 location2)
   goals met: 6 of 9
15. (unload med_crate3 uav2 location2 person3)
   deleted: (loaded med_crate3 uav2)
   added: (in med_crate3 person3) (unloaded uav2)
   goals met: 7 of 9
16. (fly uav2 location2 location1)
   deleted: (at uav2 location2)
   added: (at uav2 location1)
   goals met: 7 of 9
17. (load water_crate1 uav2 location1)
   deleted: (at water_crate1 location1) (unloaded uav2)
   added: (loaded water_crate1 uav2)
   goals met: 7 of 9
18. (fly uav2 location1 location3)
   deleted: (at uav2 location1)
   added: (at uav2 location3)
   goals met: 7 of 9
19. (unload water_crate1 uav2 location3 person1)
   deleted: (loaded water_crate1 uav2)
   added: (in water_crate1 person1) (unloaded uav2)
   goals met: 8 of 9
20. (fly uav2 location3 location1)
   deleted: (at uav2 location3)
   added: (at uav2 location1)
   goals met: 8 of 9
21. (load water_crate3 uav2 location1)
   deleted: (at water_crate3 location1) (unloaded uav2)
   added: (loaded water_crate3 uav2)
   goals met: 8 of 9
22. (fly uav2 location1 location2)
   deleted: (at uav2 location1)
   added: (at uav2 location2)
   goals met: 8 of 9
23. (unload water_crate3 uav2 location2 person3)
   deleted: (loaded water_crate3 uav2)
   added: (in water_crate3 person3) (unloaded uav2)
   goals met: 9 of 9
